/*! @hj_string.h
*******************************************************************************
</PRE>
模块名       ：字符串处理、生成以及转换相关库函数申明
文件名       ：hj_string.h
相关文件     ：hj_string.cpp
文件实现功能 ：字符串处理、生成以及转换相关库函数申明
作者         ：huangjun - 神州星国际(http://www.shenzhoustar.com)
版本         ：1.0.1
-------------------------------------------------------------------------------
备注：
-------------------------------------------------------------------------------
修改记录：
日期        版本        修改人      修改内容
20080731    1.0.1       Huangjun    Created
</PRE>
******************************************************************************/

#ifndef __HJ_STRING_H__
#define __HJ_STRING_H__

#include <ctype.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <sys/types.h>
#include <unistd.h>
#include <assert.h>

#ifndef __USE_XOPEN
#define __USE_XOPEN
#endif
#include <time.h>

#include "hj_macro.h"

/****************************************************************************
* 功能：把16进制文本转换成二进制,长度为原来的1/2
* 作者：huangjun
* 日期：2008-07-31
* 注意：在改进此算法时要尤其重视算法的性能
***************************************************************************/
int HJ_Hex_Str2Bin(BYTE *pszOut, int &nOutLen, const int &nMaxOutLen
    , const char *pszIn);

/****************************************************************************
* 功能：把二进制值转换成16进制字符串，转换后的字符串长度为输入长度的两倍
* 作者：huangjun
* 日期：2008-07-31
* 注意：在改进此算法时要尤其重视算法的性能
***************************************************************************/
int HJ_Hex_Bin2Str(char *pszOut, int &nOutLen, const int &nMaxOutLen
    , const char *pszIn, const int nInLen);

/****************************************************************************
* 功能：把字符串值转换成4个字节的Hash值
* 作者：huangjun
* 日期：2008-07-31
***************************************************************************/
unsigned long HJ_Str2Hash(const char *pszIn);

/****************************************************************************
* 功能：获取当前日期的精简格式字符串
* 作者：huangjun
* 日期：2008-07-31
* 输出：例如：20060325
* 备注：解决了TLib库中的那个同等函数不可重入的问题
***************************************************************************/
char* HJ_GetCurDateShortStr(char *pszDest, const int &nMaxOutSize);

/****************************************************************************
* 功能：获取当前日期时间格式字符串
* 作者：huangjun
* 日期：2008-07-31
* 输出：例如：2008-07-31 00:00:00
***************************************************************************/
char* HJ_GetCurDateTimeStr(char *pszDest, const int &nMaxOutSize);

/****************************************************************************
* 功能：格式化字符串的连接
* 作者：huangjun
* 日期：2006-12-08
***************************************************************************/
char* HJ_Format_StrCat(char *pszDest, size_t uDestMaxLen
    , const char *szFormat, ...);

#endif
